Tekla Open API Reference for Tekla Structures 2025
WpfProfileCatalog Class
 The WpfProfileCatalog class represents a group of controls to select profiles using the profile catalog.
 WpfProfileCatalog
Inheritance Hierarchy
System.Object
 System.Windows.Threading.DispatcherObject
 System.Windows.DependencyObject
 System.Windows.Media.Visual
 System.Windows.UIElement
 System.Windows.FrameworkElement
 System.Windows.Controls.Control
 System.Windows.Controls.ContentControl
 System.Windows.Controls.UserControl
 Tekla.Structures.Dialog.UIControls.WpfProfileCatalog
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class WpfProfileCatalog : UserControl,
	IDisposable, IComponentConnector
Public Class WpfProfileCatalog
	Inherits UserControl
	Implements IDisposable, IComponentConnector
The WpfProfileCatalog type exposes the following members.
Constructors
Name | Description
WpfProfileCatalog()
 Initiates a new instance of the control.
WpfProfileCatalog(String)
 Initiates a new instance of the control selecting the given profile.
Top
Properties
Name | Description
ButtonHeight
 Gets and sets the height of the button control.
ButtonText
 Gets and sets the text of the button control.
ButtonWidth
 Gets and sets the width of the button control.
SelectedProfile
 The selected profile in the control.
Top
Methods
Name | Description
Dispose
 Cleans up any resources being used.
InitializeComponent
 InitializeComponent
OnValueChanged
 Event handler for passing generic catalog data back to dialog
Top
Events
Name | Description
SelectClicked
 The SelectClicked event is raised when the Select button is clicked.
SelectionDone
 The SelectionDone event is raised when the selection has been done.
Top
See Also
Reference
Tekla.Structures.Dialog.UIControls Namespace